#### SetFilters Method

---

|  |
| --- |
| ElementLogicalFilter Class   See Also |

Replaces current filters in the logical filter with any number of input filters.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2020

# Syntax

| C# |
| --- |
| ``` public void SetFilters( 	IList<ElementFilter> filters ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub SetFilters ( _ 	filters As IList(Of ElementFilter) _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void SetFilters( 	IList<ElementFilter^>^ filters ) ``` |

#### Parameters

filters
:   Type:  System.Collections.Generic IList   ElementFilter
     A collection of input filters.

# Remarks

The input filters will be copied.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | The filter collection is empty, or contains invalid inputs. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

ElementLogicalFilter Class

Autodesk.Revit.DB Namespace